app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('テスト', 1, 1, '2023-06-11 12:54:47.505330', '2023-06-11 12:54:47.505330')
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save