app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes`

  def update
    if @prototype.update(prototype_params)
---
UPDATE `prototypes` SET `prototypes`.`title` = 'プロトタイプ１', `prototypes`.`catch_copy` = '試作３', `prototypes`.`concept` = '編集しますた', `prototypes`.`updated_at` = '2023-06-11 10:16:32.564269' WHERE `prototypes`.`id` = 1

  def destroy
    if @prototype.destroy
---
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 2